Infineon/psoc4pdl/drivers/include/cy_sysclk.h
/***************************************************************************//**
* \file cy_sysclk.h
* \version 1.0
*
* Provides an API declaration of the sysclk driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_sysclk
* \{
* The System Clock (SysClk) driver contains the API for configuring system and
* peripheral clocks.
*
* The functions and other declarations used in this driver are in cy_sysclk.h.
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions
* and declarations in the PDL.
*
* Firmware uses the API to configure , enable, or disable a clock.
*
* The clock system includes a variety of resources that can vary per device, including:
* - Internal clock sources such as internal oscillators
* - External clock sources such as crystal oscillators or a signal on an I/O pin
* - Generated clocks such as a PLL, System clock and peripheral clocks
*
* Consult the Technical Reference Manual for your device for details of the
* clock system.
*
* \section group_sysclk_configuration Configuration Considerations
* The availability of clock functions depend on the availability of the chip
* resources that support those functions. Consult the device TRM before
* attempting to use these functions.
*
* Low power modes may limit the maximum clock frequency.
* Refer to the SysPm driver and the TRM for details.
*
* \section group_sysclk_more_information More Information
* Refer to the technical reference manual (TRM) and the device datasheet.
*
* \section group_sysclk_MISRA MISRA-C Compliance
*
* The SysClk driver has the following specific deviations:
*
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>10.4</td>
*     <td>R</td>
*     <td>Essential type of the left hand operand dividerType (enum) is not the
*         same as that of the right operand CY_SYSCLK_DIV_16_BIT(boolean).</td>
*     <td>The \ref CY_SYSCLK_DIV_16_BIT which is considered as a boolean, is
*         actually exactly an enum of type \ref cy_en_sysclk_divider_types_t.</td>
*   </tr>
*   <tr>
*     <td>10.5</td>
*     <td>A</td>
*     <td>The value of an expression should not be cast to an inappropriate
*         essential type.</td>
*     <td>This code is safe because value is checked before conversion to the
*         enumeration.</td>
*   </tr>
*   <tr>
*     <td>10.8</td>
*     <td>R</td>
*     <td>The value of a composite expression shall not be cast to a different
*         essential type category or a wider essential type.</td>
*     <td>This code is safe because value is checked before conversion to the
*         enumeration.</td>
*   </tr>
*   <tr>
*     <td>13.5</td>
*     <td>R</td>
*     <td>The right hand operand of a logical && or || operator shall not
*         contain persistent side effects.</td>
*     <td>Manually check that side effect has no impact. It will be addressed in
*         final release.</td>
*   </tr>
* \if MISRA
*   <tr>
*     <td>14.4</td>
*     <td>R</td>
*     <td>The controlling expression of an if statement and the controlling
*         expression of an iteration-statement shall have essentially Boolean
*         type.</td>
*     <td>IGNORE: Tools issue. Manual inspection does not see any violations.</td>
*   </tr>
* \endif
* </table>
*
* \section group_sysclk_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_sysclk_macros           Macros
* \{
* \}
* \defgroup group_sysclk_enums           General Enumerated Types
* \{
*   \defgroup group_sysclk_returns         Function return values
* \}
* \defgroup group_sysclk_imo             Internal Main Oscillator (IMO)
* \{
*   The Internal Main Oscillator (IMO) is a primary clock source for
*   the CPU core and most of the peripherals. It is enabled by default
*   and is not recommended to disable without a critical need.
*
*   \defgroup group_sysclk_imo_funcs       Functions
*   \defgroup group_sysclk_imo_enums       Enumerated Types
* \}
* \defgroup group_sysclk_ext             External Clock Source (EXTCLK)
* \{
*   The External Clock Source (EXTCLK) is a clock source routed into PSoC
*   through a GPIO pin. The EXTCLK is a source clock that can be used to
*   source the processors and peripherals \ref group_sysclk_clk_hf.
*
*   The EXTCLK relies on the presence of an external clock signal applied
*   to the GPIO pin. The pin must be configured to operate in Digital
*   High-Z drive mode with input buffer on and HSIOM connection
*   set to HSIOM_SEL_ACT_0 (P0_6_SRSS_EXT_CLK).
*
*   \defgroup group_sysclk_ext_funcs       Functions
* \}
* \defgroup group_sysclk_eco             External Crystal Oscillator (ECO)
* \{
*   The External Crystal Oscillator (ECO) is a clock source that consists
*   of an oscillator circuit that drives an external crystal through its
*   dedicated ECO pins. The ECO is a source clock that can be used to
*   source one or more clock paths (Refer to \ref group_sysclk_clk_hf).
*   These clock paths can then source the processors and peripherals in
*   the device.
*
*   The ECO relies on the presence of an external crystal. The pins
*   connected to this crystal must be configured to operate in analog
*   drive mode with HSIOM connection set to GPIO control (HSIOM_SEL_GPIO).
*
*   \defgroup group_sysclk_eco_funcs       Functions
*   \defgroup group_sysclk_eco_enums       Enumerated Types
* \}
* \defgroup group_sysclk_pll             Phase Locked Loop (PLL)
* \{
*   The PLL is a clock generation circuit that can be used to produce a
*   higher frequency clock from a reference clock. The output clock exhibits
*   characteristics of the reference clock such as the accuracy of the source
*   and its phase. The PLL is similar in purpose to a (Frequency locked loop) FLL
*   but they are not equivalent.
*
*   - They may have different frequency ranges.
*   - The PLL starts up more slowly and consumes more current than the FLL.
*   - The PLL requires a higher frequency source clock than PLL.
*   ![](sysclk_pll.png)
*
*   The SysClk driver supports two models for configuring the PLL. The first
*   model is to call the Cy_SysClk_PllConfigure() function, which calculates the
*   necessary parameters for the PLL at run-time. This may be necessary for dynamic
*   run-time changes to the PLL. However this method is slow as it needs to perform
*   the calculation before configuring the PLL. The other model is to call
*   Cy_SysClk_PllManualConfigure() function with pre-calculated parameter values.
*   This method is faster but requires prior knowledge of the necessary parameters.
*   Consult the device TRM for the PLL calculation equations.
*
*   \defgroup group_sysclk_pll_funcs       Functions
*   \defgroup group_sysclk_pll_structs     Data Structures
*   \defgroup group_sysclk_pll_enums       Enumerated Types
* \}
* \defgroup group_sysclk_ilo             Internal Low-Speed Oscillator (ILO)
* \{
*   The ILO operates with no external components and outputs a clock signal at roughly
*   40 kHz. The ILO is relatively low power and low accuracy. It is available
*   in all power modes and can be used as a source for the WDT \ref group_wdt.
*
*   Additionally, the ILO clock can be trimmed using
*   a higher precision clock source. Use the \ref group_sysclk_ilo_funcs API
*   to measure the current ILO frequency and trim it.
*
*   \defgroup group_sysclk_ilo_funcs       Functions
* \}
* \defgroup group_sysclk_pm              Low Power Callback
* \{
*   Entering and exiting low power modes require compatible clock configurations
*   to be set before entering low power and restored upon wake-up and exit. The
*   SysClk driver provides a Cy_SysClk_DeepSleepCallback() function to support
*   Deep Sleep mode entry.
*
*   This function can be called either by itself before initiating low-power mode
*   entry or it can be used in conjunction with the SysPm driver as a registered
*   callback. To do so, register this function as a callback before calling
*   Cy_SysPm_DeepSleep(). Specify \ref CY_SYSPM_DEEPSLEEP as the callback type,
*   and call Cy_SysPm_RegisterCallback().
*
*   \note If the FLL or PLL source is the ECO, this function must be called.
*
*   \defgroup group_sysclk_pm_funcs        Functions
* \}
* \defgroup group_sysclk_wco             Watch Crystal Oscillator (WCO)
* \{
*   \note Not supported in Alpha release.
*
*   The WCO is a highly accurate 32.768 kHz clock source capable of operating
*   in all power modes (excluding the Off mode). It is the primary clock source for
*   the backup domain clock, which is used by the real-time clock (RTC). The
*   WCO can also be used as a source for the low-frequency clock to support other
*   low power mode peripherals.
*
*   ![](sysclk_backup.png)
*
*   The WCO requires the configuration of the dedicated WCO pins (SRSS_WCO_IN_PIN,
*   SRSS_WCO_OUT_PIN). These must be configured as Analog Hi-Z drive modes and the
*   HSIOM selection set to GPIO. The WCO can also be used in bypass mode, where
*   an external 32.768 kHz square wave is brought in directly through the
*   SRSS_WCO_OUT_PIN pin.
*
*   \defgroup group_sysclk_wco_funcs       Functions
* \}
* \defgroup group_sysclk_clk_hf          High-Frequency Clocks
* \{
*   The high frequency clock ClkHf is a source for the system clock for CPU and
*   the peropheral clock didviders.
*   High frequency clock can be sourced by IMO, PLL, ECO, EXTCLK, etc.
*   Consult the Technical Reference Manual for your device for details.
*
*   \defgroup group_sysclk_clk_hf_funcs    Functions
*   \defgroup group_sysclk_clk_hf_enums    Enumerated Types
* \}
* \defgroup group_sysclk_clk_peripheral  Peripherals Clock Dividers
* \{
*   There are multiple peripheral clock dividers that, in effect, create
*   multiple separate peripheral clocks:
*
*   - Integer 8-bit dividers
*   - Integer 16-bit dividers
*   - Fractional 16.5-bit dividers (16 integer bits, 5 fractional bits)
*   - Fractional 24.5-bit divider (24 integer bits, 5 fractional bits)
*
*   The availability and number of each type of dividers depends on teh certain device family.
*   Consult the Technical Reference Manual for your device for details.
*
*   The integer dividers work simply: a divider value of 1
*   means the output frequency matches the input frequency (that is, there is
*   no change). Otherwise the frequency is divided by the value of the divider.
*   For example, if the input frequency is 50 MHz, and the divider is value 10,
*   the output frequency is 5 MHz.
*
*   The five fractional bits supports further precision in 1/32nd increments. For
*   example, a divider with an integer value of 3 and a fractional value of
*   4 (4/32) results in a divider of 3.125. Fractional dividers are useful when
*   a high-precision clock is required, for example, for a UART/SPI serial
*   interface.
*
*   ![](sysclk_peri_divs.png)
*
*   Each peripheral can connect to any one of the programmable dividers. A
*   particular peripheral clock divider can drive multiple peripherals.
*
*   The SysClk driver also supports phase aligning two peripheral clock dividers using
*   Cy_SysClk_PeriphEnablePhaseAlignDivider(). Alignment works for both integer
*   and fractional dividers. The divider to which a second divider is aligned
*   must already be enabled.
*
*   \defgroup group_sysclk_clk_peripheral_funcs Functions
*   \defgroup group_sysclk_clk_peripheral_enums Enumerated Types
* \}
* \defgroup group_sysclk_clk_sys        System Clock
* \{
*   The system clock is the source clock for CPU core (Cortex-M0+ in PSoC 4).
*   This clock is a divided version of the \ref group_sysclk_clk_hf. A divider
*   value of 1, 2, 4 or 8 can be used to further divide the High Frequency
*   clock to a desired clock speed for the processor.
*
*   \defgroup group_sysclk_clk_sys_funcs  Functions
* \}
* \defgroup group_sysclk_clk_pump        Pump Clock
* \{
*   The pump clock is a clock source used to provide analog precision in low voltage
*   applications. Depending on the usage scenario, it may be required to drive the
*   internal voltage pump for the Continuous Time Block mini (CTBm) in the analog
*   subsystem.
*
*   \defgroup group_sysclk_clk_pump_funcs  Functions
*   \defgroup group_sysclk_clk_pump_enums  Enumerated Types
* \}
*/

#if !defined(CY_SYSCLK_H)
#define CY_SYSCLK_H

#include <stdbool.h>
#include "cy_device.h"
#include "cy_device_headers.h"
#include "cy_syslib.h"
#include "cy_syspm.h"
#include "cy_wdt.h"


#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
* \addtogroup group_sysclk_macros
* \{
*/
/** Driver major version */
#define  CY_SYSCLK_DRV_VERSION_MAJOR   1
/** Driver minor version */
#define  CY_SYSCLK_DRV_VERSION_MINOR   0
/** Sysclk driver identifier */
#define CY_SYSCLK_ID   CY_PDL_DRV_ID(0x12U)

/** ILO clock frequency */
#define CY_SYSCLK_ILO_FREQ  (40000UL)   /* Hz */
/** WCO clock frequency */
#define CY_SYSCLK_WCO_FREQ  (32768UL)   /* Hz */
/** \} group_sysclk_macros */

/**
* \addtogroup group_sysclk_returns
* \{
*/
/** Defines general-purpose function return values */
typedef enum
{
    CY_SYSCLK_SUCCESS       = 0x00UL, /**< Command completed with no errors */
    CY_SYSCLK_BAD_PARAM     = (CY_SYSCLK_ID | CY_PDL_STATUS_ERROR | 0x01UL), /**< Invalid function input parameter */
    CY_SYSCLK_TIMEOUT       = (CY_SYSCLK_ID | CY_PDL_STATUS_ERROR | 0x02UL), /**< Timeout occurred */
    CY_SYSCLK_INVALID_STATE = (CY_SYSCLK_ID | CY_PDL_STATUS_ERROR | 0x03UL), /**< Clock is in an invalid state */
    CY_SYSCLK_STARTED       = (CY_SYSCLK_ID | CY_PDL_STATUS_WARNING | 0x04UL)  /**< Ilo measurement is running */
} cy_en_sysclk_status_t;
/** \} group_sysclk_returns */


/* ========================================================================== */
/* ===========================    EXT SECTION    ============================ */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_ext_funcs
* \{
*/
    void Cy_SysClk_ExtClkSetFrequency(uint32_t freq);
uint32_t Cy_SysClk_ExtClkGetFrequency(void);
/** \} group_sysclk_ext_funcs */


/* ========================================================================== */
/* ===========================    IMO SECTION    ============================ */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_imo_enums
* \{
*/

/** IMO frequencies */
typedef enum
{
    CY_SYSCLK_IMO_24MHZ = 24000000UL, /**< 24 MHz */
    CY_SYSCLK_IMO_28MHZ = 28000000UL, /**< 28 MHz */
    CY_SYSCLK_IMO_32MHZ = 32000000UL, /**< 32 MHz */
    CY_SYSCLK_IMO_36MHZ = 36000000UL, /**< 36 MHz */
    CY_SYSCLK_IMO_40MHZ = 40000000UL, /**< 40 MHz */
    CY_SYSCLK_IMO_44MHZ = 44000000UL, /**< 44 MHz */
    CY_SYSCLK_IMO_48MHZ = 48000000UL  /**< 48 MHz */
} cy_en_sysclk_imo_freq_t;

/** IMO lock sources */
typedef enum
{
    CY_SYSCLK_IMO_LOCK_NONE     =     0U, /**< Disable IMO Locking */
    CY_SYSCLK_IMO_LOCK_WCO      =     1U, /**< Lock IMO by WCO clock */
} cy_en_sysclk_imo_lock_t;
/** \} group_sysclk_imo_enums */

/**
* \addtogroup group_sysclk_imo_funcs
* \{
*/

  cy_en_sysclk_status_t Cy_SysClk_ImoSetFrequency(cy_en_sysclk_imo_freq_t freq);
               uint32_t Cy_SysClk_ImoGetFrequency(void);
  cy_en_sysclk_status_t Cy_SysClk_ImoLock(cy_en_sysclk_imo_lock_t lock);
cy_en_sysclk_imo_lock_t Cy_SysClk_ImoGetLockStatus(void);
   __STATIC_INLINE void Cy_SysClk_ImoEnable(void);
   __STATIC_INLINE void Cy_SysClk_ImoDisable(void);
   __STATIC_INLINE bool Cy_SysClk_ImoIsEnabled(void);

/** \} group_sysclk_imo_funcs */


