Infineon/psoc4pdl/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ImoEnable
****************************************************************************//**
*
* Enables IMO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_ImoEnable(void)
{
   SRSSLT_CLK_IMO_CONFIG = SRSSLT_CLK_IMO_CONFIG_ENABLE_Msk;
}

/*******************************************************************************
* Function Name: Cy_SysClk_ImoDisable
****************************************************************************//**
*
* Returns IMO enable/disable state.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysClk_ImoIsEnabled(void)
{
   return(_FLD2BOOL(SRSSLT_CLK_IMO_CONFIG_ENABLE, SRSSLT_CLK_IMO_CONFIG));
}

/*******************************************************************************
* Function Name: Cy_SysClk_ImoDisable
****************************************************************************//**
*
* Disables IMO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_ImoDisable(void)
{
    (void) Cy_SysClk_ImoLock(CY_SYSCLK_IMO_LOCK_NONE);

    SRSSLT_CLK_IMO_CONFIG = 0UL;
}
/** \} group_sysclk_imo_funcs */



#if defined (CY_IP_M0S8EXCO) || defined(CY_DOXYGEN)
/* ========================================================================== */
/* ===========================    ECO SECTION    ============================ */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_eco_enums
* \{
*/

/** Defines IMO function return values */
typedef enum
{
    CY_SYSCLK_ECO_STABLE         = 0U, /**< ECO is stable */
    CY_SYSCLK_ECO_WATCHDOG_ERROR = 1U, /**< ECO oscillator is stuck */
} cy_en_sysclk_eco_stat_t;
/** \} group_sysclk_eco_enums */

/** \cond */
#define SRSS_CLK_ECO_STATUS_Msk (SRSS_CLK_ECO_STATUS_ECO_OK_Msk | SRSS_CLK_ECO_STATUS_ECO_READY_Msk)
/** \endcond */



/**
* \addtogroup group_sysclk_eco_funcs
* \{
*/
cy_en_sysclk_status_t Cy_SysClk_EcoConfigure(uint32_t freq, uint32_t cLoad, uint32_t esr, uint32_t driveLevel);
cy_en_sysclk_status_t Cy_SysClk_EcoEnable(uint32_t timeoutUs);
             uint32_t Cy_SysClk_EcoGetFrequency(void);
 __STATIC_INLINE bool Cy_SysClk_EcoIsEnabled(void);
 __STATIC_INLINE void Cy_SysClk_EcoDisable(void);
 __STATIC_INLINE cy_en_sysclk_eco_stat_t Cy_SysClk_EcoGetStatus(void);


/*******************************************************************************
* Function Name: Cy_SysClk_EcoIsEnabled
****************************************************************************//**
*
* Returns the ECO enable/disable state.
*
* \return
* false = disabled \n
* true = enabled
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoDisable
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysClk_EcoIsEnabled(void)
{
    return(_FLD2BOOL(EXCO_ECO_CONFIG_ENABLE, EXCO_ECO_CONFIG));
}


/*******************************************************************************
* Function Name: Cy_SysClk_EcoDisable
****************************************************************************//**
*
* Disables the external crystal oscillator (ECO). This function should not be
* called if the ECO is sourcing other resources.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoDisable
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_EcoDisable(void)
{
    EXCO_ECO_CONFIG &= ~(EXCO_ECO_CONFIG_ENABLE_Msk | EXCO_ECO_CONFIG_CLK_EN_Msk);
}


/*******************************************************************************
* Function Name: Cy_SysClk_EcoGetStatus
****************************************************************************//**
*
* Reports the current status of the external crystal oscillator (ECO).
*
* \return \ref cy_en_sysclk_eco_stat_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_EcoConfigure
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_eco_stat_t Cy_SysClk_EcoGetStatus(void)
{
    return ((cy_en_sysclk_eco_stat_t) _FLD2VAL(EXCO_ECO_STATUS_WATCHDOG_ERROR, EXCO_ECO_STATUS));
}
/** \} group_sysclk_eco_funcs */


#if defined(EXCO_PLL_PRESENT) || defined(CY_DOXYGEN)
/* ========================================================================== */
/* ===========================    PLL SECTION    ============================ */
/* ========================================================================== */
#if defined (EXCO_PLL_REF_IN_EN) || defined(CY_DOXYGEN)
/**
* \addtogroup group_sysclk_pll_enums
* \{
*/

/**
* The PLL input clock source selection.
* Used with functions \ref Cy_SysClk_PllSetSource and \ref Cy_SysClk_PllGetSource.
*/
typedef enum
{
    CY_SYSCLK_PLL_SRC_ECO = 0U, /**< PLL runs from ECO */
    CY_SYSCLK_PLL_SRC_IMO = 1U, /**< PLL runs from IMO */
} cy_en_sysclk_pll_src_t;

/** \} group_sysclk_pll_enums */



/**
* \addtogroup group_sysclk_pll_funcs
* \{
*/

                cy_en_sysclk_status_t  Cy_SysClk_PllSetSource(uint32_t pllNum, cy_en_sysclk_pll_src_t source);
__STATIC_INLINE cy_en_sysclk_pll_src_t Cy_SysClk_PllGetSource(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_PllGetSource
****************************************************************************//**
*
* Returns the clock source of the specified PLL.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
* For other pllNum values the default CY_SYSCLK_PLL_SRC_ECO value is returned.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllConfigure
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_pll_src_t Cy_SysClk_PllGetSource(uint32_t pllNum)
{
    cy_en_sysclk_pll_src_t retVal = CY_SYSCLK_PLL_SRC_ECO;
    CY_ASSERT_L1(0UL == pllNum);
    if (0UL == pllNum)
    {
        retVal = (cy_en_sysclk_pll_src_t)_FLD2VAL(EXCO_CLK_SELECT_REF_SEL, EXCO_CLK_SELECT);
    } /*  Else return the default value */
    return (retVal);
}


/** \} group_sysclk_pll_funcs */
#endif /* EXCO_PLL_REF_IN_EN */


/**
* \addtogroup group_sysclk_pll_enums
* \{
*/

/** PLL bypass mode. See register CLK_PLL_CONFIG, bits BYPASS_SEL. */
typedef enum
{
    CY_SYSCLK_PLL_OUTPUT_AUTO   = 0U, /**< Output PLL input source when not locked, and PLL output when locked */
    CY_SYSCLK_PLL_OUTPUT_AUTO1  = 1U, /**< Same as AUTO */
    CY_SYSCLK_PLL_OUTPUT_INPUT  = 2U, /**< Output PLL input source regardless of lock status */
    CY_SYSCLK_PLL_OUTPUT_OUTPUT = 3U  /**< Output PLL output regardless of lock status. This can be dangerous, because PLL output may be unstable */
} cy_en_sysclk_pll_bypass_t;

/** \} group_sysclk_pll_enums */

/**
* \addtogroup group_sysclk_pll_structs
* \{
*/
/** Structure containing information for configuration of a PLL. */
typedef struct
{
    uint32_t                       inputFreq;  /**< Frequency of the PLL source clock, in Hz.
                                                 *  This value can be left 0, then the \ref Cy_SysClk_PllConfigure
                                                 *  will get the source frequency automatically.
                                                 *  The desired source clock should be already enabled and selected
                                                 *  using \ref Cy_SysClk_PllSetSource.
                                                 */
    uint32_t                       outputFreq; /**< Frequency of the PLL output, in Hz. */
} cy_stc_sysclk_pll_config_t;

