Infineon/psoc4pdl/drivers/include/cy_sysclk.h
/** Structure containing information for manual configuration of a PLL. */
typedef struct
{
    uint8_t                        feedbackDiv;  /**< EXCO_PLL_CONFIG.FEEDBACK_DIV (P) bits */
    uint8_t                        referenceDiv; /**< EXCO_PLL_CONFIG.REFERENCE_DIV (Q) bits */
    uint8_t                        outputDiv;    /**< EXCO_PLL_CONFIG.OUTPUT_DIV bits */
    uint8_t                        icp;          /**< EXCO_PLL_CONFIG.ICP_SEL bits, usually CY_SYSCLK_IS_PLL_ICP_LT67MHZ value is recommended */
} cy_stc_sysclk_pll_manual_config_t;
/** \} group_sysclk_pll_structs */

/** \cond */
#define CY_SYSCLK_IS_PLL_ICP_LT67MHZ (2U) /* PLL Fout <= 67MHz*/
#define CY_SYSCLK_IS_PLL_ICP_GT67MHZ (3U) /* PLL Fout >  67MHz*/
/** \endcond */

/**
* \addtogroup group_sysclk_pll_funcs
* \{
*/

cy_en_sysclk_status_t Cy_SysClk_PllConfigure(uint32_t pllNum, const cy_stc_sysclk_pll_config_t * config);
cy_en_sysclk_status_t Cy_SysClk_PllManualConfigure(uint32_t pllNum, const cy_stc_sysclk_pll_manual_config_t * config);
cy_en_sysclk_status_t Cy_SysClk_PllEnable(uint32_t pllNum, uint32_t timeoutUs);
                 void Cy_SysClk_PllGetConfiguration(uint32_t pllNum, cy_stc_sysclk_pll_manual_config_t * config);
             uint32_t Cy_SysClk_PllGetFrequency(uint32_t pllNum);
 __STATIC_INLINE bool Cy_SysClk_PllIsEnabled(uint32_t pllNum);
 __STATIC_INLINE bool Cy_SysClk_PllIsLocked(uint32_t pllNum);
 __STATIC_INLINE void Cy_SysClk_PllBypass(uint32_t pllNum, cy_en_sysclk_pll_bypass_t mode);
 __STATIC_INLINE cy_en_sysclk_pll_bypass_t Cy_SysClk_PllGetBypassState(uint32_t pllNum);
 __STATIC_INLINE bool Cy_SysClk_PllLostLock(uint32_t pllNum);
 __STATIC_INLINE void Cy_SysClk_PllDisable(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_PllIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected PLL is enabled.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
* For other pllNum values the false (disabled) is returned.
*
* \return
* false = disabled \n
* true = enabled
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllManualConfigure
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysClk_PllIsEnabled(uint32_t pllNum)
{
    bool retVal = false;
    CY_ASSERT_L1(0UL == pllNum);
    if (0UL == pllNum)
    {
        retVal = _FLD2BOOL(EXCO_PLL_CONFIG_ENABLE, EXCO_PLL_CONFIG);
    } /*  Else return false (disabled) */
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PllLocked
****************************************************************************//**
*
* Reports whether or not the selected PLL is locked.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
* For other pllNum values the false (unlocked) is returned.
*
* \return
* false = not locked \n
* true = locked
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllManualConfigure
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysClk_PllIsLocked(uint32_t pllNum)
{
    bool retVal = false;
    CY_ASSERT_L1(0UL == pllNum);
    if (0UL == pllNum)
    {
        retVal = _FLD2BOOL(EXCO_PLL_STATUS_LOCKED, EXCO_PLL_STATUS);
    } /*  Else return false (unlocked) */
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PllLostLock
****************************************************************************//**
*
* Reports whether or not the selected PLL lost its lock since the last time this
* function was called. Clears the lost lock indicator.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
* For other pllNum values the false (did not lose lock) is returned.
*
* \return
* false = did not lose lock \n
* true = lost lock
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllLostLock
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysClk_PllLostLock(uint32_t pllNum)
{
    bool retVal = false;
    CY_ASSERT_L1(0UL == pllNum);
    if (0UL == pllNum)
    {
        uint32_t locReg = EXCO_PLL_TEST;
        /* write a 1 to clear the UNLOCK_OCCURRED bit */
        EXCO_PLL_TEST = locReg;
        retVal = _FLD2BOOL(EXCO_PLL_TEST_UNLOCK_OCCURRED, locReg);
    } /*  Else return false (did not lose lock) */
    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysClk_PllDisable
****************************************************************************//**
*
* Disables the selected PLL.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully disabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllManualConfigure
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PllDisable(uint32_t pllNum)
{
    CY_ASSERT_L1(0UL == pllNum);
    if (0UL == pllNum)
    {
        /* First bypass PLL */
        if (CY_SYSCLK_PLL_OUTPUT_OUTPUT == Cy_SysClk_PllGetBypassState(pllNum))
        {
            Cy_SysClk_PllBypass(pllNum, CY_SYSCLK_PLL_OUTPUT_INPUT);
        }
        /* Wait at least 6 PLL clock cycles */
        Cy_SysLib_DelayUs(1U);
        /* And now disable the PLL itself */
        EXCO_PLL_CONFIG &= ~(EXCO_PLL_CONFIG_ENABLE_Msk | EXCO_PLL_CONFIG_ISOLATE_N_Msk);
    }
}


