Infineon/psoc4pdl/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_PllBypass
****************************************************************************//**
*
* Sets PLL bypass mode.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
*
* \param mode the bypass mode \ref cy_en_sysclk_pll_bypass_t.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully disabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllDisable
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_PllBypass(uint32_t pllNum, cy_en_sysclk_pll_bypass_t mode)
{
    CY_ASSERT_L1(0UL == pllNum);
    if (0UL == pllNum)
    {
        CY_REG32_CLR_SET(EXCO_PLL_CONFIG, EXCO_PLL_CONFIG_BYPASS_SEL, mode);
    }
}


/*******************************************************************************
* Function Name: Cy_SysClk_PllGetBypassState
****************************************************************************//**
*
* Returns the PLL bypass state.
*
* \param pllNum the number of PLL instance, starting from 0.
* If there is only one PLL in device - the 0 is the only valid number.
*
* \return The bypass state \ref cy_en_sysclk_pll_bypass_t.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PllDisable
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_pll_bypass_t Cy_SysClk_PllGetBypassState(uint32_t pllNum)
{
    cy_en_sysclk_pll_bypass_t retVal = CY_SYSCLK_PLL_OUTPUT_AUTO;
    CY_ASSERT_L1(0UL == pllNum);
    if (0UL == pllNum)
    {
        retVal = (cy_en_sysclk_pll_bypass_t)_FLD2VAL(EXCO_PLL_CONFIG_BYPASS_SEL, EXCO_PLL_CONFIG);
    } /*  Else return the default value */
    return (retVal);
}

/** \} group_sysclk_pll_funcs */
#endif /* EXCO_PLL_PRESENT */
#endif /* (CY_IP_M0S8EXCO) */


/* ========================================================================== */
/* ===========================    ILO SECTION    ============================ */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_ilo_funcs
* \{
*/
__STATIC_INLINE void Cy_SysClk_IloEnable(void);
__STATIC_INLINE bool Cy_SysClk_IloIsEnabled(void);
__STATIC_INLINE cy_en_sysclk_status_t Cy_SysClk_IloDisable(void);
                 void Cy_SysClk_IloStartMeasurement(void);
                 void Cy_SysClk_IloStopMeasurement(void);
cy_en_sysclk_status_t Cy_SysClk_IloCompensate(uint32_t desiredDelay , uint32_t * compensatedCycles);


/*******************************************************************************
* Function Name: Cy_SysClk_IloEnable
****************************************************************************//**
*
* Enables the ILO.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_WcoDisable
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_IloEnable(void)
{
    SRSSLT_CLK_ILO_CONFIG |= SRSSLT_CLK_ILO_CONFIG_ENABLE_Msk;
}


/*******************************************************************************
* Function Name: Cy_SysClk_IloIsEnabled
****************************************************************************//**
*
* Returns the ILO enable/disable state.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_WcoDisable
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysClk_IloIsEnabled(void)
{
    return(_FLD2BOOL(SRSSLT_CLK_ILO_CONFIG_ENABLE, SRSSLT_CLK_ILO_CONFIG));
}


/*******************************************************************************
* Function Name: Cy_SysClk_IloDisable
****************************************************************************//**
*
* Disables the ILO. ILO can't be disabled if WDT is enabled.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ILO successfully disabled \n
* CY_SYSCLK_INVALID_STATE - Cannot disable the ILO if the WDT is enabled.
*
* \note Do not call this function if the WDT is enabled, because the WDT is clocked by
* the ILO.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloDisable
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_status_t Cy_SysClk_IloDisable(void)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_INVALID_STATE;

    if (!Cy_WDT_IsEnabled())
    {
        SRSSLT_CLK_ILO_CONFIG &= ~SRSSLT_CLK_ILO_CONFIG_ENABLE_Msk;
        retVal = CY_SYSCLK_SUCCESS;
    }

    return (retVal);
}
/** \} group_sysclk_ilo_funcs */


/* ========================================================================== */
/* ===========================    WCO SECTION    ============================ */
/* ========================================================================== */

#define CY_SYSCLK_WCO_CONFIG_DPLL_LF_LIMIT_MAX         (0xFFuL)
#define CY_SYSCLK_WCO_CONFIG_DPLL_LF_LIMIT_STEP        (16uL)
#define CY_SYSCLK_WCO_IMO_TIMEOUT_MS                   (20uL)
#define CY_SYSCLK_WCO_DPLL_TIMEOUT_MS                  (1uL)
#define CY_SYSCLK_WCO_TRIM_GM_HPM                      (0x1uL)
#define CY_SYSCLK_WCO_TRIM_XGM_2620NA                  (0x01uL)

/** Recommended WCO startup timeout for blocking \ref Cy_SysClk_WcoEnable execution */
#define CY_SYSCLK_WCO_TIMEOUT_US                       (20000UL)

/**
* \addtogroup group_sysclk_wco_funcs
* \{
*/
__STATIC_INLINE void Cy_SysClk_WcoEnable(uint32_t timeoutUs);
__STATIC_INLINE void Cy_SysClk_WcoDisable(void);
__STATIC_INLINE bool Cy_SysClk_WcoIsEnabled(void);
__STATIC_INLINE void Cy_SysClk_WcoBypass(bool bypass);


