Infineon/psoc4pdl/drivers/include/cy_sysclk.h
 /*******************************************************************************
 * Function Name: Cy_SysClk_WcoEnable
 ****************************************************************************//**
 *
 * Enables the WCO.
 *
 * \param timeoutUs - WCO startup delay in microseconds. Valid range 0..65535.
 *
 * \funcusage
 * \snippet sysclk/snippet/main.c snippet_Cy_SysClk_WcoEnable
 *
 *******************************************************************************/
 __STATIC_INLINE void Cy_SysClk_WcoEnable(uint32_t timeoutUs)
 {
     WCO_CONFIG |= WCO_CONFIG_IP_ENABLE_Msk;
     Cy_SysLib_DelayUs((uint16_t)timeoutUs);
 }


/*******************************************************************************
* Function Name: Cy_SysClk_WcoIsEnabled
****************************************************************************//**
*
* Returns the WCO enable/disable state.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_WcoBypass
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SysClk_WcoIsEnabled(void)
{
    return(_FLD2BOOL(WCO_CONFIG_IP_ENABLE, WCO_CONFIG));
}


/*******************************************************************************
* Function Name: Cy_SysClk_WcoDisable
****************************************************************************//**
*
* Disables the WCO.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_WcoDisable
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_WcoDisable(void)
{
    WCO_CONFIG &= ~WCO_CONFIG_IP_ENABLE_Msk;
}


/*******************************************************************************
* Function Name: Cy_SysClk_WcoBypass
****************************************************************************//**
*
* Enables/disables external clock input through the WCO input pin.
*
* \param bypass:
* - true - external clock input through the WCO input pin (WCO bypass enabled)
* - false - regular WCO operation (bypass disabled)
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_WcoBypass
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_WcoBypass(bool bypass)
{
    if (bypass)
    {
        WCO_CONFIG |= WCO_CONFIG_EXT_INPUT_EN_Msk;
    }
    else
    {
        WCO_CONFIG &= ~WCO_CONFIG_EXT_INPUT_EN_Msk;
    }
}

/** \} group_sysclk_wco_funcs */


/* ========================================================================== */
/* ==========================    ClkHf SECTION    =========================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_clk_hf_enums
* \{
*/
/**
* Selects which ClkHf input to configure.
* Used with functions \ref Cy_SysClk_ClkHfSetSource and \ref Cy_SysClk_ClkHfGetSource.
*/
typedef enum
{
    CY_SYSCLK_CLKHF_IN_IMO  = 0U,  /**< IMO - Internal R/C Oscillator */
    CY_SYSCLK_CLKHF_IN_EXT  = 1U,  /**< EXTCLK - External Clock Pin  */
#if defined (CY_IP_M0S8EXCO)
    CY_SYSCLK_CLKHF_IN_ECO  = 2U,  /**< ECO - External-Crystal Oscillator */
#if defined(EXCO_PLL_PRESENT)
    CY_SYSCLK_CLKHF_IN_PLL  = 6U,  /**< PLL subsystem output */
#endif /* EXCO_PLL_PRESENT */
#endif /* CY_IP_M0S8EXCO */
} cy_en_sysclk_clkhf_src_t;


/**
* Clock divider values.
* Used with functions \ref Cy_SysClk_ClkHfSetDivider, \ref Cy_SysClk_ClkHfGetDivider,
*                     \ref Cy_SysClk_ClkSysSetDivider and \ref Cy_SysClk_ClkSysGetDivider.
*/
typedef enum
{
    CY_SYSCLK_NO_DIV = 0U,    /**< don't divide */
    CY_SYSCLK_DIV_2  = 1U,    /**< divide by 2 */
    CY_SYSCLK_DIV_4  = 2U,    /**< divide by 4 */
    CY_SYSCLK_DIV_8  = 3U     /**< divide by 8 */
} cy_en_sysclk_dividers_t;
/** \} group_sysclk_clk_hf_enums */

/** \cond */
#define CY_SYSCLK_IS_DIV_VALID(div) (((div) == CY_SYSCLK_NO_DIV) || \
                                     ((div) == CY_SYSCLK_DIV_2)  || \
                                     ((div) == CY_SYSCLK_DIV_4)  || \
                                     ((div) == CY_SYSCLK_DIV_8))
/** \endcond */

/**
* \addtogroup group_sysclk_clk_hf_funcs
* \{
*/
                  cy_en_sysclk_status_t Cy_SysClk_ClkHfSetSource(cy_en_sysclk_clkhf_src_t source);
               cy_en_sysclk_clkhf_src_t Cy_SysClk_ClkHfGetSource(void);
__STATIC_INLINE                    void Cy_SysClk_ClkHfSetDivider(cy_en_sysclk_dividers_t divider);
__STATIC_INLINE cy_en_sysclk_dividers_t Cy_SysClk_ClkHfGetDivider(void);
                               uint32_t Cy_SysClk_ClkHfGetFrequency(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfSetDivider
****************************************************************************//**
*
* Sets a divider value for ClkHf.
*
* \param divider \ref cy_en_sysclk_dividers_t
*
* \return \ref cy_en_sysclk_status_t
*
* \note Also call \ref Cy_SysClk_ClkHfSetSource to set the clkHf source.
*
* \note Call \ref SystemCoreClockUpdate after this function calling.
*
* \note Call \ref Cy_SysLib_SetWaitStates before calling this function if
* ClkSys frequency is increasing.
*
* \note Call \ref Cy_SysLib_SetWaitStates after calling this function if
* ClkSys frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfSetDivider
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_ClkHfSetDivider(cy_en_sysclk_dividers_t divider)
{
    if (CY_SYSCLK_IS_DIV_VALID(divider))
    {
        CY_REG32_CLR_SET(SRSSLT_CLK_SELECT, SRSSLT_CLK_SELECT_HFCLK_DIV, divider);
    }
}


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfGetDivider
****************************************************************************//**
*
* Returns the ClkHf divider value.
*
* \return \ref cy_en_sysclk_dividers_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfSetDivider
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_dividers_t Cy_SysClk_ClkHfGetDivider(void)
{
    return ((cy_en_sysclk_dividers_t)(_FLD2VAL(SRSSLT_CLK_SELECT_HFCLK_DIV, SRSSLT_CLK_SELECT)));
}
/** \} group_sysclk_clk_hf_funcs */


/* ========================================================================== */
/* =========================    clk_sys SECTION    ========================== */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_clk_sys_funcs
* \{
*/
__STATIC_INLINE void Cy_SysClk_ClkSysSetDivider(cy_en_sysclk_dividers_t divider);
__STATIC_INLINE cy_en_sysclk_dividers_t Cy_SysClk_ClkSysGetDivider(void);
__STATIC_INLINE uint32_t Cy_SysClk_ClkSysGetFrequency(void);


