Infineon/psoc4pdl/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkSysGetFrequency
****************************************************************************//**
*
* Reports the frequency of the fast clock.
*
* \return The frequency, in Hz.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkSysSetDivider
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_ClkSysGetFrequency(void)
{
    /* Convert the ClkSys divider enumeration value into a natural number */
    uint32_t locDiv = 1UL << (uint32_t)Cy_SysClk_ClkSysGetDivider();
    /* Divide the ClkSys input frequency by the ClkSys divider */
    return (CY_SYSLIB_DIV_ROUND(Cy_SysClk_ClkHfGetFrequency(), locDiv));
}


/*******************************************************************************
* Function Name: Cy_SysClk_ClkSysSetDivider
****************************************************************************//**
*
* Sets the ClkSys clock divider, which sources the main processor.
* The source of this divider is ClkHf.
*
* \param divider - ClkSys divider value \ref cy_en_sysclk_dividers_t.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* CLK_FAST frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* CLK_FAST frequency is decreasing.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkSysSetDivider
*
*******************************************************************************/
__STATIC_INLINE void Cy_SysClk_ClkSysSetDivider(cy_en_sysclk_dividers_t divider)
{
    if (CY_SYSCLK_IS_DIV_VALID(divider))
    {
        CY_REG32_CLR_SET(SRSSLT_CLK_SELECT, SRSSLT_CLK_SELECT_SYSCLK_DIV, divider);
    }
}


/*******************************************************************************
* Function Name: Cy_SysClk_ClkSysGetDivider
****************************************************************************//**
*
* Returns the ClkSys clock divider.
*
* \return The ClkSys divider value, \ref cy_en_sysclk_dividers_t.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkSysSetDivider
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_dividers_t Cy_SysClk_ClkSysGetDivider(void)
{
    return ((cy_en_sysclk_dividers_t)_FLD2VAL(SRSSLT_CLK_SELECT_SYSCLK_DIV, SRSSLT_CLK_SELECT));
}
/** \} group_sysclk_clk_sys_funcs */


/* ========================================================================== */
/* =====================    clk_peripherals SECTION    ====================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_clk_peripheral_enums
* \{
*/
/** Programmable clock divider types */
typedef enum
{
    CY_SYSCLK_DIV_8_BIT    = 0U, /**< Divider Type is an 8 bit integer divider. Note the divider of this type may be absent on some devices */
    CY_SYSCLK_DIV_16_BIT   = 1U, /**< Divider Type is a 16 bit integer divider. Note the divider of this type may be absent on some devices */
    CY_SYSCLK_DIV_16_5_BIT = 2U, /**< Divider Type is a 16.5 bit fractional divider. Note the divider of this type may be absent on some devices */
    CY_SYSCLK_DIV_24_5_BIT = 3U  /**< Divider Type is a 24.5 bit fractional divider. Note the divider of this type may be absent on some devices */
} cy_en_sysclk_divider_types_t;
/** \} group_sysclk_clk_peripheral_enums */

/** \cond */
#define cy_en_divider_types_t cy_en_sysclk_divider_types_t /* BWC macro for capsense!!! */
/** \endcond */

/**
* \addtogroup group_sysclk_clk_peripheral_funcs
* \{
*/
cy_en_sysclk_status_t Cy_SysClk_PeriphSetDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum, uint32_t dividerValue);
             uint32_t Cy_SysClk_PeriphGetDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum);
cy_en_sysclk_status_t Cy_SysClk_PeriphSetFracDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum, uint32_t dividerIntValue, uint32_t dividerFracValue);
                 void Cy_SysClk_PeriphGetFracDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum, uint32_t *dividerIntValue, uint32_t *dividerFracValue);
cy_en_sysclk_status_t Cy_SysClk_PeriphAssignDivider(en_clk_dst_t periphNum, cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum);
cy_en_sysclk_status_t Cy_SysClk_PeriphEnableDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum);
cy_en_sysclk_status_t Cy_SysClk_PeriphDisableDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum);
cy_en_sysclk_status_t Cy_SysClk_PeriphEnablePhaseAlignDivider(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum, cy_en_sysclk_divider_types_t dividerTypePA, uint32_t dividerNumPA);
                 bool Cy_SysClk_PeriphDividerIsEnabled(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum);
             uint32_t Cy_SysClk_PeriphGetFrequency(cy_en_sysclk_divider_types_t dividerType, uint32_t dividerNum);
__STATIC_INLINE uint32_t Cy_SysClk_PeriphGetAssignedDivider(en_clk_dst_t periphNum);


/*******************************************************************************
* Function Name: Cy_SysClk_PeriphGetAssignedDivider
****************************************************************************//**
*
* Reports which clock divider is assigned to a selected IP block.
*
* \param periphNum specifies the peripheral block \ref en_clk_dst_t.
*
* \return The divider type and number, where bits [7:6] = type, bits[5:0] = divider
* number within that type
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PeriphAssignDivider
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_PeriphGetAssignedDivider(en_clk_dst_t periphNum)
{
    CY_ASSERT_L1(PERI_PCLK_CLOCK_NR > (uint32_t)periphNum);
    return (PERI_PCLK_CTL[periphNum] & (PERI_PCLK_CTL_SEL_DIV_Msk | PERI_PCLK_CTL_SEL_TYPE_Msk));
}

/** \} group_sysclk_clk_peripheral_funcs */


/* ========================================================================== */
/* =========================    clk_pump SECTION    ========================= */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_clk_pump_enums
* \{
*/
/**
* Pump clock (clk_pump) input sources. See CLK_SELECT register, PUMP_SEL bits.
* Used with functions \ref Cy_SysClk_ClkPumpSetSource, and \ref Cy_SysClk_ClkPumpGetSource.
*/
typedef enum
{
    CY_SYSCLK_PUMP_IN_GND   = 0UL,  /**< No clock, connect to gnd */
    CY_SYSCLK_PUMP_IN_IMO   = 1UL,  /**< Use main IMO output */
    CY_SYSCLK_PUMP_IN_HFCLK = 2UL   /**< Use clk_hf (using selected source after predivider but before prescaler) */
} cy_en_sysclk_clkpump_src_t;
/** \} group_sysclk_clk_pump_enums */

