Infineon/psoc4pdl/drivers/include/cy_sysclk.h
/** \cond */
#define  CY_SYSCLK_IS_PUMP_SRC_VALID(src) (((src) == CY_SYSCLK_PUMP_IN_GND) || \
                                           ((src) == CY_SYSCLK_PUMP_IN_IMO) || \
                                           ((src) == CY_SYSCLK_PUMP_IN_HFCLK))
/** \endcond */

/**
* \addtogroup group_sysclk_clk_pump_funcs
* \{
*/
                     cy_en_sysclk_status_t Cy_SysClk_ClkPumpSetSource(cy_en_sysclk_clkpump_src_t source);
__STATIC_INLINE cy_en_sysclk_clkpump_src_t Cy_SysClk_ClkPumpGetSource(void);
__STATIC_INLINE                   uint32_t Cy_SysClk_ClkPumpGetFrequency(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkPumpGetSource
****************************************************************************//**
*
* Reports the source for the pump clock (clk_pump).
*
* \return \ref cy_en_sysclk_clkpump_src_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPumpSetSource
*
*******************************************************************************/
__STATIC_INLINE cy_en_sysclk_clkpump_src_t Cy_SysClk_ClkPumpGetSource(void)
{
    return ((cy_en_sysclk_clkpump_src_t)_FLD2VAL(SRSSLT_CLK_SELECT_PUMP_SEL, SRSSLT_CLK_SELECT));
}


/*******************************************************************************
* Function Name: Cy_SysClk_ClkPumpGetFrequency
****************************************************************************//**
*
* Reports the frequency of the pump clock (clk_pump).
*
* \return The frequency of the pump clock in Hz.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPumpSetSource
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SysClk_ClkPumpGetFrequency(void)
{
    uint32_t freq = 0UL;

    switch (Cy_SysClk_ClkPumpGetSource())
    {
        case CY_SYSCLK_PUMP_IN_IMO:
            freq = Cy_SysClk_ImoGetFrequency();
            break;

        case CY_SYSCLK_PUMP_IN_HFCLK:
            freq = Cy_SysClk_ClkHfGetFrequency();
            break;

        default: /* return zero for CY_SYSCLK_PUMP_IN_GND */
            break;
    }

    return (freq);
}


/** \} group_sysclk_clk_pump_funcs */


#if defined(__cplusplus)
}
#endif /* __cplusplus */

#endif /* CY_SYSCLK_H */

/** \} group_sysclk */


/* [] END OF FILE */
